Emacs.org
#+title: Emacs From Scratch config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Preamble
#+begin_src emacs-lisp
  ;; Note that init.el is generated from ./Emacs.org - that is the file that should be edited
  ;; on first install, do M-x all-the-icons-install-fonts, M-x treesit-install-language-grammar
  ;; and M-x pdf-tools-install
#+end_src

* Package System Setup (elpaca)
** Elpaca
Using [[https://github.com/progfolio/elpaca][elpaca]] for fast, parallel, and reproducible package management.
This code is based on the official README.

#+begin_src emacs-lisp
  ;; --- Elpaca Bootstrap ---
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                               :ref nil :depth 1 :inherit ignore
                               :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                               :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                        ,@(when-let* ((depth (plist-get order :depth)))
                                                            (list (format "--depth=%d" depth) "--no-single-branch"))
                                                        ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; --- Elpaca use-package Integration ---
  
  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable use-package :ensure support for elpaca.
    (elpaca-use-package-mode)
    ;; Make elpaca manage all use-package declarations by default.
    (setq elpaca-use-package-by-default t))

#+end_src
** Shell PATH
Ensure Emacs inherits the system $PATH so it can test for programs in the rest of the config
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :ensure t
    :config
    (when (memq window-system '(x mac ns))
      (exec-path-from-shell-initialize)))
#+end_src
* Core Emacs Config
Using =use-package= to configure the built-in Emacs settings.
This replaces the old "Basic UI Config" and "Font config" sections.
On linux, we want [[https://github.com/tonsky/FiraCode][FiraCode]] and [[https://fonts.google.com/specimen/Cantarell][Cantarell]]; on windows, Consolas and Segoe UI are defaults apparently.
#+begin_src emacs-lisp
  (use-package emacs
     
    :ensure nil ;; This is a built-in package
    :init
    ;; Settings to apply very early, before config is fully loaded
    (setq inhibit-startup-message t)

    :config
    ;; --- Basic UI Tweaks ---
    (column-number-mode)
    (global-display-line-numbers-mode t)
    (setq visible-bell t)

    ;; Disable line numbers in modes where they don't make sense
    (dolist (mode '(org-mode-hook
                    term-mode-hook
                    vterm-mode-hook
                    shell-mode-hook
                    eshell-mode-hook
                    eww-mode-hook
                    pdf-view-mode-hook)) 
      (add-hook mode (lambda () (display-line-numbers-mode 0)))) 

    ;; --- GUI Specific Tweaks ---
    (when (display-graphic-p) 
      (add-to-list 'default-frame-alist '(alpha-background . 95))
      (add-to-list 'default-frame-alist '(fullscreen . maximized)) 
      (scroll-bar-mode -1) 
      (tool-bar-mode -1) 
      (tooltip-mode -1) 
      (menu-bar-mode -1) 
      (set-fringe-mode 5)) 

    ;; --- Font Configuration ---
    (cond
     ((find-font (font-spec :name "FiraCode Nerd Font"))
      (message "Using FiraCode Nerd Font")
      (set-face-attribute 'default nil :font "FiraCode Nerd Font" :height 130) 
      (set-face-attribute 'fixed-pitch nil :font "FiraCode Nerd Font" :height 130)) 
     ((find-font (font-spec :name "Consolas"))
      (message "Using Consolas as a fallback")
      (set-face-attribute 'default nil :font "Consolas" :height 130) 
      (set-face-attribute 'fixed-pitch nil :font "Consolas" :height 130))
     (t
      (message "Neither FiraCode nor Consolas found, using emacs default.")))

    (cond
     ((find-font (font-spec :name "Cantarell"))
      (message "Using Cantarell for variable-pitch") 
      (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 140 :weight 'regular)) 
     ((find-font (font-spec :name "Segoe UI"))
      (message "Using Segoe UI as a fallback for variable pitch") 
      (set-face-attribute 'variable-pitch nil :font "Segoe UI" :height 140 :weight 'regular)) 
     (t
      (message "Neither Cantarell nor Segoe UI found, using emacs default.")))) 
#+end_src

* More UI and UX Config
Theming, Completion and Help
** Colour Theme
Take suggestions from [[https://github.com/hlissner/emacs-doom-themes][doom-themes]]
#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t
    :init (load-theme 'doom-dracula t))
#+end_src
** Modeline
Another element of doom emacs that's nice is [[https://github.com/seagle0128/doom-modeline][modeline]]. It has a bunch of its own config options, and on first run it needs =M-x all-the-icons-install-fonts=
#+begin_src emacs-lisp
  (use-package all-the-icons :ensure t)
  (use-package nerd-icons :ensure t)
  (use-package doom-modeline
    :ensure t
    :after (all-the-icons nerd-icons)
    :config
    (require 'all-the-icons) ;;not sure if this is needed
    (if (and (display-graphic-p) (member "all-the-icons" (font-family-list)))
  	(progn
  	  (doom-modeline-mode 1)
  	  (setq doom-modeline-height 15))
          (message "doom-modeline not enabled - either fonts not found or we're in a TTY. M-x all-the-icons-install-fonts")))
#+end_src
** Which Key
[[https://github.com/justbur/emacs-which-key][which-key]] offers all completions for any key prefix - now part of default emacs.
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :init (which-key-mode)
    :diminish which-key-mode
    :config (setq which-key-idle-delay 0.5))
#+end_src
** Vertico, Consult, Marginalia
The modern, minimal replacement for Ivy, Counsel, and Ivy-rich.
   =vertico= is the vertical completion UI.
   =orderless= is the completion style (replaces =ivy=).
   =consult= provides the powerful search commands (replaces =counsel=).
   =marginalia= adds the rich annotations (replaces =ivy-rich=).

#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :init
    (vertico-mode 1)
    ;; Add cycling with TAB
    (setq vertico-cycle t))

  (use-package orderless
    :ensure t
    :config
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles . (partial-completion))))))

  (use-package consult
    :ensure t
    :bind
    ;; Re-bind the keys we had for counsel
    (("M-x" . execute-extended-command)
     ("C-x b" . consult-buffer) ;; A good replacement for counsel-ibuffer
     ;; C-x C-f (find-file) uses vertico automatically
     :map minibuffer-local-map
     ("C-r" . consult-history)))

  (use-package marginalia
    :ensure t
    :after vertico
    :init
    (marginalia-mode 1))
#+end_src
