init.el

(use-package helpful
  :ensure t
  :bind
  ;; Remap the default describe-* commands to helpful's versions
  ([remap describe-function] . helpful-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key))

(defun nij/org-font-setup ()
  (font-lock-add-keywords 'org-mode
			  '(("^ *\([-]\) "
			     (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  (let ((variable-font
         (cond
          ((find-font (font-spec :name "Cantarell")) "Cantarell")
          ((find-font (font-spec :name "Segoe UI")) "Segoe UI")
          (t nil))))
    (when variable-font
      (dolist (face '((org-level-1 . 1.2)
                      (org-level-2 . 1.1)
                      (org-level-3 . 1.05)
                      (org-level-4 . 1.0)
                      (org-level-5 . 1.0)
                      (org-level-6 . 1.0)
                      (org-level-7 . 1.0)
                      (org-level-8 . 1.0)))
        (set-face-attribute (car face) nil :font variable-font :weight 'regular :height (cdr face)))))

  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(defun nij/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1)
  )

(use-package org
   
  :ensure nil
  :hook (org-mode . nij/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")
  (nij/org-font-setup))

(use-package org-superstar
  :ensure t
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-prettify-item-priority t)
  (setq org-superstar-prettifiers
	(list
	 '(org-superstar-priority-prettifier . org-superstar-prettify-priority)
	 ))
  (setq org-superstar-priority-faces nil)
  (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●"))
  )

(let ((babel-languages '((emacs-lisp . t))))
  (when (executable-find "python")
    (push '(python . t) babel-languages))
  (when (executable-find "haskell")
    (push '(haskell . t) babel-languages))
  (org-babel-do-load-languages 'org-babel-load-languages babel-languages))
(push '("conf-unix" . conf-unix) org-src-lang-modes)

(use-package org-tempo
   
  :ensure nil ; It's part of org so won't needed installed
  :after org  ; Ensure org is loaded first
  :config
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("hs" . "src haskell")))

(defun nij/org-babel-tangle-config ()
  "Automatically tangle our Emacs.org config file when we save it"
  (when (string-equal (buffer-file-name)
		      (expand-file-name "~/.emacs.d/Emacs.org"))
    ;; Dynamic scoping example
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))
(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'nij/org-babel-tangle-config)))

(setq treesit-language-source-alist
  '((bash "https://github.com/tree-sitter/tree-sitter-bash")
    (c "https://github.com/tree-sitter/tree-sitter-c")
    (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
    (cmake "https://github.com/uyha/tree-sitter-cmake")
    (css "https://github.com/tree-sitter/tree-sitter-css")
    (elisp "https://github.com/Wilfred/tree-sitter-elisp")
    (go "https://github.com/tree-sitter/tree-sitter-go")
    (haskell "https://github.com/tree-sitter/tree-sitter-haskell")
    (html "https://github.com/tree-sitter/tree-sitter-html")
    (java "https://github.com/tree-sitter/tree-sitter-java")
    (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
    (json "https://github.com/tree-sitter/tree-sitter-json")
    (make "https://github.com/alemuller/tree-sitter-make")
    (markdown "https://github.com/ikatyang/tree-sitter-markdown")
    (php "https://github.com/tree-sitter/tree-sitter-php" "master" "php/src")
    (python "https://github.com/tree-sitter/tree-sitter-python")
    (regex "https://github.com/tree-sitter/tree-sitter-regex")
    (rust "https://github.com/tree-sitter/tree-sitter-rust")
    (toml "https://github.com/tree-sitter/tree-sitter-toml")
    (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
    (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
    (yaml "https://github.com/ikatyang/tree-sitter-yaml")))
(add-to-list 'major-mode-remap-alist '(c-mode . c-ts-mode))
(add-to-list 'major-mode-remap-alist '(c++-mode . c++-ts-mode))

(defun shell-other-window ()
  "Open a 'shell' buffer in another window"
  (interactive)
  (let ((buf (shell)))
    (switch-to-buffer (other-buffer buf))
    (switch-to-buffer-other-window buf))
  )

(use-package flymake :ensure t)
(use-package jsonrpc :ensure t)
(use-package eglot
  :ensure t
  :hook ((haskell-mode . eglot-ensure)
	 (java-ts-mode . eglot-ensure)
	 (python-mode . eglot-ensure)
	 (js-mode . eglot-ensure)
	 (typescript-mode . eglot-ensure)
	 (c-ts-mode . eglot-ensure)
	 (c++-ts-mode . eglot-ensure)
	 )
  :bind (:map eglot-mode-map
	      ("M-." . xref-find-definitions)
	      ("M-," . xref-pop-marker-stack)
	      ("C-c a" . eglot-code-actions)
	      )
  :config
  (let ((haskell-lsp (expand-file-name "~/.ghcup/bin/haskell-language-server-wrapper")))
    (when (file-exists-p haskell-lsp)
      (add-to-list 'eglot-server-programs
                   `(haskell-mode . (,haskell-lsp "--lsp")))))
  (setq eglot-auto-server-display nil) ;Don't autodisplay server-buffer on restart
  (setq eglot-reconnect-on-change t)
  (setq eglot-autodocument t) ; on mouse-over
  (setq eglot-autodocument-delay 1)
  (setq eglot-display-buffer-function #'eglot-display-buffer-at-bottom)
  )
