Emacs.org
*** C++
C, C++ and cmake settings - using the newer treesitter modes
#+begin_src emacs-lisp
  (defun nij/cmake-configure-preset ()
    "Run 'cmake --preset default' in the project root."
    (interactive)
    (if (executable-find "cmake")
        (let ((compile-command "cmake --preset default")) (compile compile-command))
      (message "Error: 'cmake' not in PATH.")
      ))
#+end_src

#+begin_src emacs-lisp
  (defun nij/c-ts-mode-common-setup ()
    "Common setup for C/C++ tree-sitter modes."
    ;; This replaces 'c-basic-offset' and 'c-set-style'.
    (setq-local treesit-indent-level 4)
      
    ;; Bind keys to the C TS map. 
    ;; c++-ts-mode inherits from c-ts-mode, so it gets these keys too.
    (define-key c-ts-mode-map (kbd "C-c c") #'compile)
    (define-key c-ts-mode-map (kbd "C-c s") #'shell-other-window)
    )
  (defun nij/cpp-ts-mode-setup ()
    "C++ specific setup."
    ;; Bind your C++ specific key
    (define-key c++-ts-mode-map (kbd "C-c C-p") #'nij/cmake-configure-preset)
    )
  ;; Add the hooks for the new modes
  (add-hook 'c-ts-mode-hook #'nij/c-ts-mode-common-setup)
  (add-hook 'c++-ts-mode-hook #'nij/cpp-ts-mode-setup)
#+end_src
*** Java
Java settings - using the newer treesitter version
#+begin_src emacs-lisp

(add-to-list 'major-mode-remap-alist '(java-mode . java-ts-mode))

(defun nij/java-ts-mode-setup ()
  "Keybinds for java-ts-mode."
  (define-key java-ts-mode-map (kbd "C-c c") #'compile))

(add-hook 'java-ts-mode-hook #'nij/java-ts-mode-setup)
#+end_src
*** Javascript/Typescript
Major mode for JS/TS, integrate Prettier, and a REPL.
#+begin_src emacs-lisp
  (use-package typescript-mode
    :ensure t
    :mode (("\\.ts\\'" . typescript-mode)
           ("\\.tsx\\'" . typescript-mode))
    :config
    (setq typescript-indent-level 2))

  ;; Only load prettier-js if the 'prettier' executable is found
  (when (executable-find "prettier")
    (use-package prettier-js
      :ensure t
      :hook ((js-mode . prettier-js-mode)
             (typescript-mode . prettier-js-mode)
             (web-mode . prettier-js-mode))
      :config
      (add-hook 'js-mode-hook
                (lambda ()
                  (add-hook 'before-save-hook 'prettier-js-before-save nil 'local)))
      (add-hook 'typescript-mode-hook
                (lambda ()
                  (add-hook 'before-save-hook 'prettier-js-before-save nil 'local)))
      ))
  (when (executable-find "node")
    (use-package nodejs-repl
      :ensure t
      :hook (js-mode . (lambda ()
                         (define-key js-mode-map (kbd "C-c C-j") 'nodejs-repl-run-current-file)))
      :hook (typescript-mode . (lambda ()
                                 (define-key typescript-mode-map (kbd "C-c C-j") 'nodejs-repl-run-current-file)))
      ))  
#+end_src

*** Haskell
#+begin_src emacs-lisp
    (use-package haskell-mode   :ensure nil :defer t)
#+end_src

** Completion (Corfu)
A lightweight, fast, and modern completion UI (replaces =company=).
=kind-icon= integrates with =all-the-icons= to provide icons,
replacing =company-box=.

#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :custom
    ;; These mirror our company settings
    (corfu-auto t)
    (corfu-auto-prefix 1)
    (corfu-auto-delay 0.0)
    (corfu-cycle t)               ; Allow cycling
    (corfu-popupinfo-delay 0.5)   ; Show extra info in a popup
    :bind
    ;; Binds TAB to 'corfu-complete'.
    ;; This is smarter than company-complete-selection:
    ;; - It indents if at the start of a line.
    ;; - It completes if there's a completion.
    (:map corfu-map
          ("<tab>" . corfu-complete)
          ("TAB" . corfu-complete))
    :config
    (global-corfu-mode 1)) ;; in config so it's not lazy, to avoid race condition with kind-icon

  (use-package kind-icon
    :ensure t
    :after corfu
    :config
    ;; This function adds the icons to the corfu popup
    (add-to-list 'corfu-format-functions #'kind-icon-corfu-format))
#+end_src
** Project Management (Projectile)
#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    ;; :defer t is no longer needed, as :bind-keymap and :init handle it
    :diminish projectile-mode
    :custom ((projectile-completion-system 'default))
    :bind-keymap
     ("C-c p" . projectile-command-map)
    :init
    ;; Enable the global minor mode via its autoload
    (projectile-mode 1)
    
    ;; Set variables before the package is loaded
    (when (file-directory-p "~/Projects/Code")
      (setq projectile-project-search-path '("~/Projects/Code")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package consult-projectile
    :ensure t
    :after (projectile consult)
    :bind (:map projectile-command-map
                ("f" . consult-projectile-find-file)
                ("s" . consult-projectile-switch-project)))
#+end_src
** Version Control (Magit)
#+begin_src emacs-lisp
  (use-package transient :ensure t)
  (use-package magit
    :ensure t
    :bind (("C-x g" . magit-status)) ;; This implicitly makes it lazy
    :config
    (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    (let ((auth-file (expand-file-name "~/.authinfo.gpg")))
      (when (file-exists-p auth-file)
        (use-package forge
          :ensure t
          :after magit 
          :config (setq auth-sources `(,auth-file))))))
#+end_src
** Rainbow Delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
* File Management (dired)
Some slight customisations . Remember to =:ensure nil=. =dired-single= if we get annoyed by the multiple dired buffers. =dired-open= if we want to directly open binary files in eg feh, mpv, etc.
#+begin_src emacs-lisp
  (use-package dired
     
    :ensure nil
    :commands (dired dired-jump)
    :custom ((dired-listing-switches "-alh --group-directories-first")
    	   (wdired-allow-to-change-permissions t))
    :config
    (require 'dired-x))

  ;; Only load all-the-icons-dired if we are in GUI and fonts are installed
  (when (and (display-graphic-p) (member "all-the-icons" (font-family-list)))
    (use-package all-the-icons-dired
      :ensure t
      :hook (dired-mode . all-the-icons-dired-mode)))

  (use-package dired-hide-dotfiles
    :ensure t
    :hook (dired-mode . dired-hide-dotfiles-mode)
    )

#+end_src
* PDF Tools
From [[https://github.com/vedang/pdf-tools][PDF Tools]] - it is awesome, but it needs libpoppler, poppler-glib and epdfinfo on the host system.
#+begin_src emacs-lisp
  (use-package pdf-tools
    :ensure t
    :defer t
    :commands (pdf-tools-install pdf-loader-install) ; Make install commands available
    :mode ("\\.pdf\\'" . pdf-view-mode)
    :bind (:map pdf-view-mode-map
                ("C-=" . pdf-view-enlarge)
                ("C--" . pdf-view-shrink))
    :config
    ;; Check if the compiled server component is available
    (if (require 'pdf-tools-server nil 'noerror)
        ;; If YES, then configure the package
        (progn
          (setq revert-without-query (concat "\(" (regexp-quote ".pdf") "\|.*\.pdf\.lock\)"))
          ;; Add the hook for your midnight mode here
          (add-hook 'pdf-view-mode-hook 'nij/pdf-view-midnight-mode-setup))
      
      ;; If NO, print a helpful message
      (message "pdf-tools server not compiled. Run 'M-x pdf-tools-install'.")))

  (defun nij/pdf-view-midnight-mode-setup ()
    "Enable pdf-view-midnight-minor-mode in pdf-view-mode."
    (pdf-view-midnight-minor-mode 1))
#+end_src
* LaTeX
Lazy-load AUCTeX when a .tex file is opened.
#+begin_src emacs-lisp
  (use-package auctex
    :ensure t
    :mode ("\\.tex\\'" . LaTeX-mode) ; -- This is the lazy-loading trigger
    :config
    ;; Set the default viewing programs
    (setq TeX-view-program-selection
          '(((output-dvi has-no-display-manager) "dvi2tty")
            ((output-dvi style-pstricks) "dvips and gv")
            (output-dvi "xdvi")
            (output-pdf "PDF Tools")) ; auctex will find pdf-tools
          TeX-view-program-list
          '(("PDF Tools" TeX-pdf-tools-sync-view))
          TeX-source-correlate-start-server t)

    ;; Conditionally add 'xdg-open' for HTML if it exists
    (when (executable-find "xdg-open")
      (add-to-list 'TeX-view-program-selection '(output-html "xdg-open")))

    ;; Refresh buffer after compilation
    (add-hook 'TeX-after-compilation-finished-functions
              #'TeX-revert-document-buffer))
#+end_src
