Emacs.org
* Vterm
A linux-only terminal, based on the libvterm library. We define a helper function to multiplex it and lazy-load the package via keybindings.
#+begin_src emacs-lisp
  (defun nij/vterm-new ()
    "Open a new vterm buffer with a unique name."
    (interactive)
    (vterm (generate-new-buffer-name "*vterm*")))
    
  (use-package vterm
    :ensure t
    :config
    (setq shell-file-name "/bin/bash"
          vterm-max-scrollback 5000) 
    :bind (("C-c t" . vterm)
           ("C-c T" . nij/vterm-new))) 
#+end_src
* Other things
-  At some point, I should try and get music, video, IRC, RSS, email, and matrix working. 
-  I'd also like to experiment with EXWM
- is it possible to offer to install external dependencies??  
- straight.el or elpaca? 
