init.el

(defun nij/vterm-new ()
  "Open a new vterm buffer with a unique name."
  (interactive)
  (vterm (generate-new-buffer-name "*vterm*")))
  
(use-package vterm
  :ensure t
  :config
  (setq shell-file-name "/bin/bash"
        vterm-max-scrollback 5000) 
  :bind (("C-c t" . vterm)
         ("C-c T" . nij/vterm-new)))
